In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('no_kp_2digit.csv')

In [3]:
df

  name         ic_no
0  ABC  900118038976
1  DEF  890118038976
2  GHJ  340118038976
3  KLP  920118038976

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   ic_no   4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [7]:
df['ic_no'] = df['ic_no'].apply(str)

In [8]:
df['tahun'] = df['ic_no'].str[:2]

In [9]:
df

  name         ic_no tahun
0  ABC  900118038976    90
1  DEF  890118038976    89
2  GHJ  340118038976    34
3  KLP  920118038976    92